const fs = require('fs');

let raw_users = [
        {
            "ФИО": "Аноров Павел Станиславович",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Алешин Андрей Георгиевич",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Ахметова Ильвира Ильгизовна",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Алашеев Александр",
            "Роль": "техспец"
        },
        {
            "ФИО": "Ашуралиев Артур Нежмутдинович",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Баброва (Торощина) Дарья Юрьевна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Волынкина Ксения Николаевна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Гайворонская Светлана Владимировна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Гречко Дарья Николаевна ",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Демьяченко Анастасия",
            "Роль": "техспец"
        },
        {
            "ФИО": "Дроздова Анна Михайловна",
            "Роль": "техспец"
        },
        {
            "ФИО": "Дунаева Юлия Евгеньевна ",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Джугели Евгения Александровна",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Егоров Евгений Валерьевич",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Ёлкин Александр Викторович",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Ертылёва Анастасия Владимировна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Захарова Алеся Сергеевна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Зимовец Елизавета Сергеевна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Еремина Анжела Анатольевна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Ефимова Ирина Алексеевна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Зайцев Иван Михайлович",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Захряпин Владимир Владимирович",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Злыгостев Сергей Юрьевич",
            "Роль": "техспец"
        },
        {
            "ФИО": "Кириллова Анастасия Александровна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Комаревцев Константин Игоревич",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Кондырева Татьяна Владимировна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Корсакова Анна Николаевна",
            "Роль": "техспец"
        },
        {
            "ФИО": "Корсакова Вероника Андреевна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Кугучев Владислав Александрович",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Кузьмин Максим Андреевич ",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Мельникова Надежда Викторовна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Мурашев Андрей Владимирович",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Мухаметшин Ринат Фагилевич",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Назаренко Станислав Сергеевич",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Невиницына Марина Валерьевна",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Остапович Сергей Дмитриевич",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Овсянников Алексей Николаевич",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Пышняк Станислав Валерьевич",
            "Роль": "техспец"
        },
        {
            "ФИО": "Ребров Иван Владимирович",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Росийскова Анна Олеговна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Самосват Артем Александрович",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Снытко Игорь Геннадьевич",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Солдатов Дмитрий Васильевич",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Степанов Александр Александрович",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Страшнов Михаил Михайлович",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Тарасенко Иван Дмитриевич",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Усачева Дарья Алексеевна",
            "Роль": "техспец"
        },
        {
            "ФИО": "Фалалеева Екатерина Николаевна",
            "Роль": "техспец"
        },
        {
            "ФИО": "Фалалеев Роман Николаевич",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Филимонова Елена Александровна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Фуфлыгин Алексей Михайлович",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Хитяева Анастасия Геннадьевна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Шайбакова Алина Рустамовна",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Шепелёв Василий Александрович",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Плаксий Татьяна Геннадьевна",
            "Роль": "тимлид"
        },
        {
            "ФИО": "Лихолетов Александр",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Стельмахович Егор Сергеевич",
            "Роль": "техспец"
        },
        {
            "ФИО": "Павленко Антон Сергеевич",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Розова Анастасия",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Капырина Дарья",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Горелова Ольга",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Ефремцев Александр",
            "Роль": "Консультант"
        },
        {
            "ФИО": "Кальная Анна",
            "Роль": "Координатор"
        },
        {
            "ФИО": "Корженевская Вероника",
            "Роль": "Координатор"
        },
        {
            "ФИО": "Игнатов Илья",
            "Роль": "Координатор"
        },
        {
            "ФИО": "Привалов Александр",
            "Роль": "Координатор"
        },
        {
            "ФИО": "Рудакова Елена",
            "Роль": "Координатор"
        },
        {
            "ФИО": "Белов Александр",
            "Роль": "аналитик"
        },
        {
            "ФИО": "Породина Надежда",
            "Роль": "аналитик"
        },
        {
            "ФИО": "Мирющенко Елена",
            "Роль": "аналитик"
        },
        {
            "ФИО": "Ивахин Дмитрий",
            "Роль": "аналитик"
        },
        {
            "ФИО": "Самбулова Мила",
            "Роль": "администратор"
        },
        {
            "ФИО": "Сидорова Ольга",
            "Роль": "администратор"
        },
        {
            "ФИО": "Трофимова Анастасия",
            "Роль": "администратор"
        },
        {
            "ФИО": "Афанасьева Ольга",
            "Роль": "администратор"
        },
        {
            "ФИО": "Самойлова Ксения",
            "Роль": "администратор"
        },
        {
            "ФИО": "Табачина Анна",
            "Роль": "менеджер"
        },
        {
            "ФИО": "Латушкин Артем",
            "Роль": "менеджер"
        },
        {
            "ФИО": "Долганев Марат",
            "Роль": "менеджер"
        },
        {
            "ФИО": "Шаховский Слава",
            "Роль": "менеджер"
        },
        {
            "ФИО": "Звягинцев Роман",
            "Роль": "менеджер"
        }
    ]

function translit(str) {
    let space = '';
    let link = '';
    let transl = {
        'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'e', 'ж': 'zh',
        'з': 'z', 'и': 'i', 'й': 'j', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
        'о': 'o', 'п': 'p', 'р': 'r','с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h',
        'ц': 'c', 'ч': 'ch', 'ш': 'sh', 'щ': 'sh','ъ': space,
        'ы': 'y', 'ь': space, 'э': 'e', 'ю': 'yu', 'я': 'ya',
    }
    if (str != '') str = str.toLowerCase();

    for (var i = 0; i < str.length; i++){
        if (/[а-яё]/.test(str.charAt(i))){
            link += transl[str.charAt(i)];
        } else if (/[a-z0-9]/.test(str.charAt(i))){ 
            link += str.charAt(i);
        } else {
            if (link.slice(-1) !== space) link += space;
        }
    }
    return link; 
}   


function password() {
    let words = 'qwertyuiopasdfghjklzxcvbnm'
    let word = '';
    const randint = (min, max) => {
        return +(Math.random() * (max - min) + min).toFixed(0)
    };
    for (let i = 0; i < 10; i++) {
        word = word + words[randint(1, words.length - 1)]
    }
    return word;
    
}

function ucFirst(str) {
    let newStr = str[0].toUpperCase() + str.slice(1);
    return newStr
}


let users = []

for (let i = 0; i < raw_users.length; i++) {
    users.push({
        "role": ucFirst(raw_users[i]['Роль']),
        "name": raw_users[i]['ФИО'],
        "password": password(),
        "login": translit(raw_users[i]['ФИО']),
        "photo": null,
        "Badges": [],
        "medals": [],
        "thanks": [],
        "like": [],
        "ideas": [],
        "id": i
    });
    
}
console.log(users);

fs.writeFileSync('./users.json', JSON.stringify(users));